sn-induction_3D/openfoam_template_steady/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freeSurf
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    meltWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    crysInter
    {
        type            nutkWallFunction;
        value           uniform 0;
    }       
}


// ************************************************************************* //
